In [1]:
import pandas as pd
import numpy as np

In [2]:
# create a dataframe
df=pd.DataFrame()
type(df)

pandas.core.frame.DataFrame

In [21]:
l=np.array([1,2,3,4,5,])
df=pd.DataFrame(l)
#df=pd.DataFrame(l,dtype=float) # chenage datatype
df

   0
0  1
1  2
2  3
3  4
4  5

In [34]:
# insert elements into dataframe using numpy
l=np.array([[1,2],[3,4],[5,6]])
df=pd.DataFrame(l,columns=['one','two'])
#df.columns=['one','two']
#df.ndim   # find the number of dimentions
df

   one  two
0    1    2
1    3    4
2    5    6

In [37]:
# create a dataframe using list of tuples
t=[("one",12),("two",13),("three",14)]
df=pd.DataFrame(t,columns=['name','marks'])
df

    name  marks
0    one     12
1    two     13
2  three     14

In [69]:
# create a dataframe using dictionary
d={"name":['a','b','c'],"marks":[12,3,14]}
df=pd.DataFrame(d)
df

  name  marks
0    a     12
1    b      3
2    c     14

In [72]:
df.set_index('name')
#df.set_index('name',inplace=True)

      marks
name
a        12
b         3
c        14

In [66]:
df

      marks
name
a        12
b         3
c        14

In [67]:
df.reset_index(inplace=True)

In [68]:
df

  name  marks
0    a     12
1    b      3
2    c     14

### access data from df

In [89]:
d={'sname':['a','b','c','d','e'],'smarks':[10,20,30,40,50]}
df=pd.DataFrame(d)
df

  sname  smarks
0     a      10
1     b      20
2     c      30
3     d      40
4     e      50

In [90]:
df['sname']

0    a
1    b
2    c
3    d
4    e
Name: sname, dtype: object

In [98]:
#df.columns=["snames","smarks"] #update the columns
#df.columns   # get the columns name
# df.index    #get the index range
#df['sname']   # get the sname column
#df[['sname','smarks']]
df[df.columns[1:]]

   smarks
0      10
1      20
2      30
3      40
4      50

In [124]:
df.set_index('sname',inplace=True)

In [125]:
df

       smarks
sname
a          10
b          20
c          30
d          40
e          50

In [131]:
df.loc[:'a']

       smarks
sname
a          10

In [137]:
df.iloc[0:3]

       smarks
sname
a          10
b          20
c          30

In [138]:
df.reset_index(inplace=True)

In [139]:
df

  sname  smarks
0     a      10
1     b      20
2     c      30
3     d      40
4     e      50

In [144]:
initial_data = {'First_name': ['Ram', 'Mohan', 'Tina', 'Jeetu', 'Meera'],  
                'Last_name': ['Kumar', 'Sharma', 'Ali', 'Gandhi', 'Kumari'],  
                'Marks': [12, 52, 36, 85, 23] } 
  
df = pd.DataFrame(initial_data, columns = ['First_name', 'Last_name', 'Marks'])
df

  First_name Last_name  Marks
0        Ram     Kumar     12
1      Mohan    Sharma     52
2       Tina       Ali     36
3      Jeetu    Gandhi     85
4      Meera    Kumari     23

In [147]:
result=[]
for i in df['Marks']:
    if i>0 and i<=25:
        result.append("fail")
    elif i>25 and i<=40:
        result.append("thrid")
    elif i>40 and i<=60:
        result.append("second")
    else:
        result.append("first")
df['results']=result

In [148]:
df

  First_name Last_name  Marks results
0        Ram     Kumar     12    fail
1      Mohan    Sharma     52  second
2       Tina       Ali     36   thrid
3      Jeetu    Gandhi     85   first
4      Meera    Kumari     23    fail

In [156]:
df[1:]

  First_name Last_name  Marks results
1      Mohan    Sharma     52  second
2       Tina       Ali     36   thrid
3      Jeetu    Gandhi     85   first
4      Meera    Kumari     23    fail

In [161]:
df[df['results']=='fail']

  First_name Last_name  Marks results
0        Ram     Kumar     12    fail
4      Meera    Kumari     23    fail

In [169]:
df[df['Marks']>30]

  First_name Last_name  Marks results
1      Mohan    Sharma     52  second
2       Tina       Ali     36   thrid
3      Jeetu    Gandhi     85   first

In [175]:
df[['First_name','Last_name']][df['Marks']==df['Marks'].max()]

  First_name Last_name
3      Jeetu    Gandhi

In [186]:
mydf=df[(df['Marks']<15) & (df['results']=='fail')]
mydf

  First_name Last_name  Marks results
0        Ram     Kumar     12    fail

In [209]:
import requests

In [210]:
url = 'https://www.worldcoinindex.com/'

In [211]:
crypto_url = requests.get(url)

In [212]:
crypto_url

In [213]:
crypto_data = pd.read_html(crypto_url.text)

In [205]:
crypto_data = crypto_data[0]

In [206]:
crypto_final = crypto_data.iloc[:,2:]

In [207]:
crypto_final.head()

,Name,Ticker,Last price,%,24 high,24 low,Price Charts 7d,24 volume,# Coins,Market cap
0,Bitcoin,BTC,"$ 10,906",-0.47%,"$ 11,046","$ 10,861",NaN,$ 5.38B,18.49M,$ 201.66B
1,Ethereum,ETH,$ 380.72,+4.14%,$ 384.68,$ 364.35,NaN,$ 3.86B,112.63M,$ 42.88B
2,Tron,TRX,$ 0.026827,+2.02%,$ 0.027389,$ 0.026288,NaN,$ 798.34M,66.68B,$ 1.78B
3,Chainlink,LINK,$ 10.92,+1.53%,$ 11.70,$ 10.65,NaN,$ 686.02M,350.00M,$ 3.82B
4,Eos,EOS,$ 2.73,+0.75%,$ 2.77,$ 2.71,NaN,$ 631.94M,1.01B,$ 2.78B